; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v6 ?v5)
             (pred_12 ?v12 ?v1)
             (pred_9 ?v6 ?v1)
             (pred_10 ?v2 ?v6 )
	     (pred_3 ?v6)
             (pred_8 ?v10)
             (pred_6 ?v12)
             (pred_1 ?v1)
             (pred_4 ?v6)
             (pred_5 ?v12)
             (pred_2 ?v6)
             (pred_7 ))



(:action op_3
:parameters (?v3 ?v11 ?v13 ?v9)
:precondition (and (pred_8 ?v3) (pred_8 ?v11) (pred_6 ?v13) (pred_1 ?v9)
          (pred_11 ?v3 ?v11) (pred_12 ?v13 ?v9)
                   (pred_9 ?v11 ?v9) (pred_3 ?v3) 
                   (pred_4 ?v11) (pred_5 ?v13))
:effect (and  (pred_2 ?v11) (not (pred_4 ?v11))))


(:action op_5
:parameters (?v3 ?v4)
:precondition (and (pred_8 ?v3) (pred_8 ?v4)
               (pred_3 ?v3) (pred_11 ?v3 ?v4) (pred_2 ?v4))
:effect (and (pred_3 ?v4) (not (pred_3 ?v3))))

(:action op_2
:parameters (?v3 ?v13)
:precondition (and (pred_8 ?v3) (pred_6 ?v13) 
                  (pred_3 ?v3) (pred_10 ?v13 ?v3) (pred_7 ))
:effect (and (pred_5 ?v13)
   (not (pred_10 ?v13 ?v3)) (not (pred_7 ))))


(:action op_1
:parameters (?v3 ?v8 ?v7)
:precondition (and (pred_8 ?v3) (pred_6 ?v8) (pred_6 ?v7)
                  (pred_3 ?v3) (pred_5 ?v7) (pred_10 ?v8 ?v3))
:effect (and (pred_5 ?v8) (pred_10 ?v7 ?v3)
        (not (pred_5 ?v7)) (not (pred_10 ?v8 ?v3))))

(:action op_4
:parameters (?v3 ?v13)
:precondition (and (pred_8 ?v3) (pred_6 ?v13) 
                  (pred_3 ?v3) (pred_5 ?v13))
:effect (and (pred_7 ) (pred_10 ?v13 ?v3) (not (pred_5 ?v13)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_08 obj_14 obj_12 obj_15 obj_18 obj_07 obj_17 obj_21 obj_13 obj_20 obj_05 obj_02 obj_09 obj_19 obj_01
    obj_06 obj_03
    obj_04 obj_16 obj_10
    )

    (:init
       (pred_7)

       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_14)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_18)
       (pred_8 obj_07)
       (pred_8 obj_17)
       (pred_8 obj_21)
       (pred_8 obj_13)
       (pred_8 obj_20)
       (pred_8 obj_05)
       (pred_8 obj_02)
       (pred_8 obj_09)
       (pred_8 obj_19)
       (pred_8 obj_01)
       (pred_1 obj_06)
       (pred_1 obj_03)
       (pred_6 obj_04)
       (pred_6 obj_16)
       (pred_6 obj_10)

       (pred_11 obj_11 obj_15)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_08 obj_18)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_08 obj_11)
       (pred_11 obj_14 obj_07)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_15 obj_21)
       (pred_11 obj_15 obj_18)
       (pred_11 obj_15 obj_11)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_18 obj_08)
       (pred_11 obj_18 obj_15)
       (pred_11 obj_07 obj_20)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_14)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_21 obj_02)
       (pred_11 obj_21 obj_13)
       (pred_11 obj_21 obj_15)
       (pred_11 obj_13 obj_09)
       (pred_11 obj_13 obj_20)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_21)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_20 obj_07)
       (pred_11 obj_20 obj_13)
       (pred_11 obj_05 obj_01)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_02 obj_09)
       (pred_11 obj_02 obj_21)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_09 obj_13)
       (pred_11 obj_09 obj_02)
       (pred_11 obj_19 obj_01)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_01 obj_05)
       (pred_11 obj_01 obj_19)
       (pred_4 obj_20)
       (pred_4 obj_09)
       (pred_4 obj_21)
       (pred_9  obj_20 obj_06)
       (pred_9  obj_09 obj_03)
       (pred_9  obj_21 obj_03)
       (pred_2 obj_11)
       (pred_2 obj_08)
       (pred_2 obj_14)
       (pred_2 obj_12)
       (pred_2 obj_15)
       (pred_2 obj_18)
       (pred_2 obj_07)
       (pred_2 obj_17)
       (pred_2 obj_13)
       (pred_2 obj_05)
       (pred_2 obj_02)
       (pred_2 obj_19)
       (pred_2 obj_01)

       (pred_12  obj_04 obj_06)
       (pred_12  obj_16 obj_03)
       (pred_12  obj_10 obj_03)
       (pred_10 obj_04 obj_14)
       (pred_10 obj_16 obj_15)
       (pred_10 obj_10 obj_17)
       (pred_3 obj_07)
    )

    (:goal (and
       (pred_10 obj_04 obj_18)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_10 obj_09)
    ))
(:constraints
  (always (not (pred_3 obj_08)))
)
)

; plan
1. (op_5 obj_07 obj_17)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_17)
   goals met: 0 of 3
2. (op_2 obj_17 obj_10)
   deleted: (pred_10 obj_10 obj_17) (pred_7)
   added: (pred_5 obj_10)
   goals met: 0 of 3
3. (op_5 obj_17 obj_07)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_07)
   goals met: 0 of 3
4. (op_5 obj_07 obj_18)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_18)
   goals met: 0 of 3
5. (op_5 obj_18 obj_13)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_13)
   goals met: 0 of 3
6. (op_3 obj_13 obj_09 obj_10 obj_03)
   deleted: (pred_4 obj_09)
   added: (pred_2 obj_09)
   goals met: 0 of 3
7. (op_5 obj_13 obj_09)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_09)
   goals met: 0 of 3
8. (op_4 obj_09 obj_10)
   deleted: (pred_5 obj_10)
   added: (pred_7) (pred_10 obj_10 obj_09)
   goals met: 1 of 3
9. (op_5 obj_09 obj_13)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_13)
   goals met: 1 of 3
10. (op_5 obj_13 obj_18)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_18)
   goals met: 1 of 3
11. (op_5 obj_18 obj_15)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_15)
   goals met: 1 of 3
12. (op_2 obj_15 obj_16)
   deleted: (pred_10 obj_16 obj_15) (pred_7)
   added: (pred_5 obj_16)
   goals met: 1 of 3
13. (op_5 obj_15 obj_18)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_18)
   goals met: 1 of 3
14. (op_4 obj_18 obj_16)
   deleted: (pred_5 obj_16)
   added: (pred_7) (pred_10 obj_16 obj_18)
   goals met: 2 of 3
15. (op_5 obj_18 obj_07)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_07)
   goals met: 2 of 3
16. (op_5 obj_07 obj_14)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_14)
   goals met: 2 of 3
17. (op_2 obj_14 obj_04)
   deleted: (pred_10 obj_04 obj_14) (pred_7)
   added: (pred_5 obj_04)
   goals met: 2 of 3
18. (op_5 obj_14 obj_07)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_07)
   goals met: 2 of 3
19. (op_5 obj_07 obj_18)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_18)
   goals met: 2 of 3
20. (op_4 obj_18 obj_04)
   deleted: (pred_5 obj_04)
   added: (pred_7) (pred_10 obj_04 obj_18)
   goals met: 3 of 3
